# 1 Задание
my_string = input("Введите название вашей страны и горада через пробел: ")
print("название вашей страны и города состоит из ",len(my_string)-1,"букв")
# 2 задание
print(my_string.upper())
print(my_string.lower())
print(my_string.replace(" ",""))
print(my_string[0])
print(my_string[-1])